import {html} from 'https://unpkg.com/lit-html?module';
import { logoutEvent } from '../../index.js';
import { navTemplateBg, setUserNav } from './navigation.js';

const infoTemplateBg = () => html`
${navTemplateBg()}
    <section class="blog-content">
<div class="blog-content-container">
  <div id="blog1-content">
    <section class="main-post">
      <div class="main-post-container">
        <article id="actual-post">
          <h3>Топ 3 причини<br>които могат да ви накарат<br>да се откажете от писането</h3>
          <p>Всеки писател живее в различен свят - свят на мечтите, в който продава милиони копия от книгата си и
            с
            радост дава автографи на всеки от своите почитатели навсякъде, където го срещнат. Свят, в който дори
            Холивуд
            не звучи меко казано странно. В тази алтернативна реалност писането става <strong>"като по
              вода"</strong>.
            Носен на крилете на вдъхновението, изпълнен с опиянение от идващата слава, писателят твори без страх и
            колебание... защото успехът дебне зад ъгъла. Той го знае, усеща го! Неговата работа ще предизвика
            фурор!
            Това ще доведе до промяна в хората, ще ги направи по-добри, ще промени съдбите им дори... когато видят
            посланието, съдържащо се между редовете на неговата книга...</p>

          <p>Но идва ден, когато този утопичен свят бавно се топи пред очите на писателя. Защо? Ами защото той е
            достигнал определена точка, в която иска да продължи, но не намира нито помощ, нито разбиране от
            света.
            <strong>Причини?</strong> Има много причини. Позволете ми да споделя моите <strong>Топ 3:</strong>
          </p>
          <img src="images/problems-1.png" alt="Kumiho's blog">
          <p><strong>Причина първа:</strong> Ръкописът е завършен, но после накъде? Както всички останали, стигнах
            до
            този момент и блокирах за известно време. Накрая взех нещата в свои ръце и започнах да чета и да търся
            информация за това какво се случва с писателите в нашата родна страна и как успяват да пробият на
            пазара. Не
            бях очарована от моите открития, които биха могли да доведат всеки изтощен човек до депресия. Реших да
            не се
            отказвам и започнах да търся издател, който да одобри работата ми за публикуване. Защото (помните ли?)
            имаше
            план да се става известен и сега няма време за губене! Но, уви! Нямам познати, които работят в
            областта на
            редакторски/ издателски услуги, нито идея кое издателство върху кой жанр се е фокусирало и кои
            ръкописи
            приема (и ако ги приема изобщо, чете ли ги или някой там просто натиска Delete на клавиатурата?).
            Чувала
            съм, че има литературни агенции, които свалят това бреме от раменете ви и ви помагат да подпишете
            договор за
            издателство, но засега реших да ги пропусна и да изпълня тази мисия сама. След известно време намерих
            издателство и смело изпратих целия набор от документи: кратък синопсис на книгата, мотивационно писмо,
            автобиография, в която (за жалост) трябваше да призная следното:</p>
          <ul>
            <li> Нямам предишен опит в областта на книгоиздаването</li>
            <li> Досега нито една от моите творби не е публикувана</li>
            <li> Нямам препоръки от други автори</li>
          </ul>
          <img src="images/problems-3.png" alt="Kumiho's blog">
          <p>Всичко това звучи зловещо, но какво трябваше да направя? Да излъжа? Както и да е, изпратих и самия
            ръкопис.
            Чудех се: да го изпратя ли цял или просто откъси от него? Накрая реших, че няма от какво да се
            притеснявам и
            весело натиснах бутона „Изпрати“. Това се случи на 16 ноември 2018 г. На уебсайта на издателя се
            казва, че
            отговорът трябва да бъде даден в рамките на три месеца и само ако бъде одобрен. Тих глас в главата ми
            веднага се възмути от тази несправедливост, но аз я заглуших и се въоръжих с търпение. И така останах
            спокойна до края на януари.</p>
          <p>Преди няколко дни, докато пиех кафето си на кухненската маса и се подготвях за работа, внезапно
            получих
            прозрение и очите ми най-накрая се отвориха за жестоката истина - сигурно няма да одобрят ръкописа ми!
            Но
            защо? Не е ли страхотно, идеята е добра, уникална дори ... кой би отказал да публикува толкова
            прекрасно
            произведение? И тогава си спомних, че моята работа всъщност е планирана като част от трилогия и че
            само
            първата книга ще бъде в диапазона от 500-600 стандартни страници. Очевидно издателят не иска да
            рискува с
            начинаещ писател, който дори не предоставя наистина завършено произведение! Оттук идва първият ми
            съвет към
            вас - нека първата ви работа бъде по-кратка - така че възможността за одобрение ще бъде по-голяма,
            защото
            разходите за публикуване трябва да бъдат по-ниски. Не рискувайте, не губете време да пишете дълги
            романи,
            както направих аз. Явно подобни ръкописи са инвестиция с неизвестен финансов резултат, нали ме
            разбирате?
          </p>
          <img src="images/problems-4.png" alt="Kumiho's blog">
          <a id="go-back-up" href="#actual-post2"><i class="fas fa-arrow-alt-circle-up"></i> Продължи да
            четеш...</a>
        </article>
        <article id="actual-post2">
          <p>След като приех идеята, че може да не бъда одобрена за публикуване, се замислих за нещо друго - защо
            съществува тази практика на мълчаливо отхвърляне на ръкописи? Стивън Кинг беше казал в интервю, че
            писателят
            никога не трябва да се страхува от отказ, че ще получи много откази, че трябва да свикне с тях, да ги
            приеме
            и да потърси нов начин за издаване на книгата си. Но какво се случва, ако изобщо не получим отказ или
            дори
            отговор от издателите? Несигурността плаши повече. Не можех да не направя сравнение с АПК (за тези,
            които не
            знаят какво е това е Административнопроцесуалният кодекс на Република България), а именно с чл. 58.
            (1)
            "Непроизнасянето в срок се счита за мълчалив отказ за издаване на акта.", С тази разлика, че законът
            ви дава
            право да обжалвате мълчаливия отказ пред съда. Има известна справедливост, нали? А къде бих могла да
            обжалвам мълчаливото отхвърляне на книгата ми от издателите? Никъде.</p>
          <p>Въпреки че това е глас в пустинята, моето предложение към издателите е да въведат нова, по-уважителна
            практика. Всички знаем, че са изключително заети и нямат време за кореспонденция, но едно кратко
            изречение
            от рода на: „Извинете, но вашият ръкопис беше отхвърлен от нашия издател!“ това би помогнало на автора
            изключително много, за да може да продължи напред и да потърси късмета си другаде, вместо да губи
            време в
            напразни надежди и да чака отговор. Преди работех в банковия сектор. Там служителите са претоварени от
            документация, но винаги ще намерят време да отговорят на телефонно обаждане, писмо или имейл. Работата
            им
            по-малко ли е важна от тази на издателите? И къде намират време да свършат тази неприятна работа
            тогава?
            Въпреки че съм отхвърлена, бих искала това да се прави с уважение към мен и работата ми. Благодаря
            предварително!</p>
          <p><strong>Причина втора:</strong> Не получавам отговор от издател, какво следва тогава? Втората ми
            стъпка
            логично би била да изпратя ръкописа си на друг издател с надеждата, че ще се заинтересува от него. Но
            не
            искам да започна да го изпращам безразборно наляво и надясно, нито смятам, че е правилното нещо.
            Междувременно се заинтересувах от условията за самоиздаване, но резултатът от моето изследване ще бъде
            предмет на отделна статия. Да, самоиздаването може да е чудесна идея! Това, което може да ви спре да
            пишете
            и публикувате книга в този случай, е липсата на средства. Ще трябва да платите на експерти, за да
            редактирате ръкописа, да направите корекция, страниране, дизайн на корицата, илюстрации (ако има
            такива) и
            да отпечатате книгата накрая. Или може би искате и да я рекламирате? Това ще струва допълнително.</p>
          <img src="images/problems-5.png" alt="Kumiho's blog">
          <p><strong>Причина трета:</strong> семейството ми не ме подкрепя достатъчно, какво да направя? Случвало
            ли ви
            се е? Всички близки се радват на вашата работа и вдъхновение, но това е краят на тяхната подкрепа. Те
            имат
            свои собствени грижи - работа, домакинство, деца, дългове, хобита. Ти и твоят текст сте като хлебарка
            в крем
            за лице - странно и не на място в тяхната сурова реалност. Те те потупват по рамото, хвалят се на
            познати,
            но всъщност не правят нищо, за да помогнат. Напротив, те не ви дават време да се отдадете на писането
            сами,
            или директно ви свалят на земята с реплика от рода: "Не се занимавай толкова много стия неща! В
            България
            така или иначе няма печалба от писането на книги! Трябва да имаш връзки, за да успееш у нас!" Те
            приемат
            писането ти като загуба на време, като лудост и напразна мечта. Моят съвет е, не ги слушайте и не им
            позволявайте да ви влияят негативно. Ако сте запознати със закона на привличането и така наречените
            <strong>вибрации</strong>, знайте, че ако не направите нещо и не се защитите, несъмнено ще бъдете
            погълнати
            от отрицателната енергия на другите. Не, те не са енергийни вампири (макар... дали?), но те са
            реалисти и
            смятат, че трябва да си намерите достойна работа, а не да тракате по клавиатурата по цял ден. И все
            пак
            <strong>продължавайте</strong>! Нека техните думи бъдат стимул за вас да успеете и да им докажете, че
            са
            сгрешили! Вярвайте в себе си! Когато получите още една доза сарказъм, просто не отговаряйте! Изпънете
            гърба
            си, поемете дълбоко въздух, задръжте дъха си и издишайте! Това ще успокои мислите ви и ще ви даде
            възможност
            да проектирате мечтаната реалност, а не да се потопите в техния свят и негативизъм! Направете план,
            създайте
            свое собствено ръководство за успех! Имайте цел и я следвайте неотклонно! <strong>Смело
              напред!</strong>
            <br>
            Февруари, 2019
          </p>
          <img src="images/problems-2.png" alt="Kumiho's blog">
        </article>
      </div>
    </section>
  </div>
</div>
</section>`;

export async function infoPageBg(context) {
    const userId = sessionStorage.getItem("userId");
    context.render(infoTemplateBg(userId != null));
    setUserNav();
    logoutEvent();
}


